server/app/controllers/api/favourites_controller.rb

  def index
    render json: Favourites.all
---
SELECT "favourites".* FROM "favourites"

  def show
    puts params[:stockSymbol]
    render json: Favourites.where(stockSymbol: params[:id])
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."stockSymbol" = $1  [["stockSymbol", "ibm"]]

  def create
    favourite = Favourites.create(stockSymbol: params[:stockSymbol], stockName: params[:stockName])
---
INSERT INTO "favourites" ("stockSymbol", "stockName", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["stockSymbol", "JK"], ["stockName", "Jonno"], ["created_at", "2021-04-01 08:43:05.615526"], ["updated_at", "2021-04-01 08:43:05.615526"]]

  def destroy
    Favourites.where(stockSymbol: params[:id]).destroy_all
---
DELETE FROM "favourites" WHERE "favourites"."id" = $1  [["id", 4]]
SELECT "favourites".* FROM "favourites" WHERE "favourites"."stockSymbol" = $1  [["stockSymbol", "stockSymbol"]]