server/app/controllers/api/favourites_controller.rb

      def show
        puts params[:id]
        render json: Favourites.find(params[:id])
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]